// && - логический оператор "и", || - логический оператор "или",
// ! логический оператор "нет", ?? - оператор нулевого слияния (при сравнение возвращает первое значение которое определили(не null и не undefined))
// console.log(1 || true || "hi" || 2)
// let x 
// true || (x=1)
// console.log(x)
// console.log ( 2 && 5 && "hi");
// (x>0) && console.log("hi");
// console.log(!true) 
// console.log(!!null)
// console.log(x ?? "hi")
// const timeNow = prompt("Какое сейчас время","от 0 до 23")
// if(timeNow <= 5 || timeNow === 23){
//     alert("Спокойной ночи")
// } else if(timeNow <= 11){
//     alert("Доброе утро")
// } else if (timeNow <= 16){
//     alert ("Добрый день")
// } else {
//     alert("Добрый вечер")
// }
// Виведи модальне вікно prompt з пропозицією користувача ввести будь-яке
// число від 0 до 100. Перевір, чи ділиться введене користувачем число на 2 та 3
// без залишку. Виведи в консоль один із таких результатів:
// Число ділиться на 2 та на 3 без залишку;
// Число ділиться без залишку лише на 2;
// Число ділиться без залишку лише на 3;
// Число не ділиться без залишку на 2 та на 3.
let questionNumber = prompt("Введите любое число от 0 до 100")
let divisionOnTwo = questionNumber % 2 === 0
let divisionOnThree = questionNumber % 3 === 0
if(divisionOnTwo && divisionOnThree){
    alert("Число ділиться на 2 та на 3 без залишку")
} else if (divisionOnTwo){
    alert("Число ділиться без залишку лише на 2")
} else if(divisionOnThree){
    alert("Число ділиться без залишку лише на 3")
} else{
    alert("Число не ділиться без залишку на 2 та на 3")
}